In [1]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

import random
import time
import uuid

from datetime import datetime, timedelta
import pycountry

pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [2]:
# https://stackoverflow.com/a/553320
def str_time_prop(start, end, format, prop):
    """Get a time at a proportion of a range of two formatted times.

    start and end should be strings specifying times formated in the
    given format (strftime-style), giving an interval [start, end].
    prop specifies how a proportion of the interval to be taken after
    start.  The returned time will be in the specified format.
    """

    stime = time.mktime(time.strptime(start, format))
    etime = time.mktime(time.strptime(end, format))

    ptime = stime + prop * (etime - stime)

    return time.strftime(format, time.localtime(ptime))


def random_date(start, end, size):
    unique_dates = set()
    while len(unique_dates) < size : 
        unique_dates.add(str_time_prop(start, end, "%Y-%m-%d %H:%M:%S", random.random())) 
    return list(unique_dates)

In [3]:
def random_uid(size):
    unique_uid = set()
    while len(unique_uid) < size : 
        unique_uid.add(str(uuid.uuid1())) 
    return list(unique_uid)

In [4]:
def random_login(size):
    unique_uid4 = set()
    while len(unique_uid4) < size : 
        unique_uid4.add(str(uuid.uuid4())) 
    return list(unique_uid4)

In [5]:
countries = [item.name for item in pycountry.countries ]
def random_countries(size):
    return random.choices(countries, k = size)

In [6]:
def fix_date(date_time_str):
    dt = datetime.strptime(date_time_str, '%Y-%m-%d %H:%M:%S')  + timedelta(hours=20) 
    return dt.strftime('%Y-%m-%d %H:%M:%S')

# Task 1

## 1. Create a database structure and fill it with test data.

In [7]:
size = 1000
users = pd.DataFrame(columns=['uid', 'registration_date', 'country'])
users['uid'] = random_uid(size)
users['registration_date'] = random_date("2020-04-01 13:30:00", "2020-09-17 16:50:00", size)
#users['registration_date'] = pd.to_datetime(users['registration_date'])
users['country'] =  random_countries(size)

In [8]:
size_logins = 5000
logins = pd.DataFrame(columns=['user_uid', 'login', 'account_type']) 
logins['login'] = random_login(size_logins)
logins['user_uid'] = random.choices(users.uid.tolist(),k=size_logins)
logins['account_type'] = random.choices(['real', 'demo'],k=size_logins, cum_weights=[0.4, 0.6])

In [9]:
#tb_operations (operation_type: deposit/withdrawal, operation_date, login, amount (in USD), ...) 
operations_size = 10000
operations  = pd.DataFrame(columns=['operation_type', 'operation_date', 'login', 'amount'])
operations['login'] = random.choices(logins.login.tolist(), k = operations_size)
operations['operation_type'] = random.choices(['deposit', 'withdrawal'],k=operations_size, cum_weights=[0.4, 0.6])
operations['amount'] = random.sample(range(30, 50000), operations_size)

In [10]:
# make sure operation date is higher than registration_date

In [11]:
user_login = logins.merge(users, how = 'left', left_on = 'user_uid', right_on='uid')
login_operation = operations.merge(user_login, how = 'left', on = 'login')

In [12]:
login_operation['operation_date'] = login_operation.apply(lambda row : 
                                        random_date(fix_date(row["registration_date"]), "2020-09-18 00:00:00", 1)[0] ,axis=1)

operations = login_operation[['operation_type', 'operation_date', 'login', 'amount']].copy()

del login_operation

In [13]:
#tb_orders (login, order_close_date,...)
orders_size = 20000
orders  = pd.DataFrame(columns=['login', 'order_close_date'])
orders['login'] =  random.choices(operations.sample(2000).login.unique(), k = orders_size)

orders_operation = orders.merge(operations, how = 'inner', on = 'login')

In [15]:
orders_operation['order_close_date'] = orders_operation.apply(lambda row : 
                random_date(fix_date(row["operation_date"]), "2020-09-18 00:00:00", 1)[0] ,axis=1)

orders = orders_operation[['login', 'order_close_date']]
del orders_operation

In [ ]:
users['registration_date'] = pd.to_datetime(users['registration_date'])
operations['operation_date'] = pd.to_datetime(operations['operation_date'])
orders['order_close_date'] = pd.to_datetime(orders['order_close_date'])

In [17]:
### insert data to postgres db
connection = create_engine('postgresql://postgres:pwd@localhost:5432/postgres')

In [18]:
conn = psycopg2.connect(host='localhost',port="5432",user='postgres',password ="pwd" ,database='postgres') 
cursor = conn.cursor()
cursor.execute("CREATE SCHEMA IF NOT EXISTS orderstat;")
cursor.execute("CREATE SCHEMA IF NOT EXISTS billing;")
conn.commit()
cursor.close()
conn.close()

In [19]:
users.to_sql('users', connection, schema='public', index=False, if_exists='replace')

In [20]:
logins.to_sql('logins', connection, schema='public', index=False, if_exists='replace')

In [21]:
operations.to_sql('operations', connection, schema='billing', index=False, if_exists='replace')

In [22]:
orders.to_sql('orders', connection, schema='orderstat', index=False, if_exists='replace')

## 2. Write a query that displays the average user transition time between funnel stages:

### - From Registration to Deposit

In [23]:
sql_2_1 = """ SELECT country,
       Avg(Extract(epoch FROM ( current_date :: timestamp - registration_date ::timestamp))) AS avg_time_sec,
       Count(DISTINCT users.UID) number_of_user
FROM   users
       join logins
         ON user_uid = UID
       join (SELECT login,
                    Min(operation_date)
             FROM   billing.operations
             WHERE  operation_type = 'deposit'
             GROUP  BY login) op USING (login)
WHERE  account_type = 'real'
       AND registration_date :: DATE >= current_date - 90
GROUP  BY country
ORDER  BY number_of_user DESC;  
"""

In [24]:
data_2_1 = pd.read_sql(sql_2_1, connection)
data_2_1.head()

                  country  avg_time_sec  number_of_user
0                   Italy   3371363.765               7
1  Bosnia and Herzegovina   5680223.231               6
2               Guatemala   4743385.000               6
3                Guernsey   3910247.650               6
4    United Arab Emirates   4657496.700               5

### - From making a Deposit to the first transaction on a real account

In [25]:
sql_2_2 = """ SELECT country,
       Avg(Extract(epoch FROM ( current_date :: timestamp - registration_date ::
                                timestamp
                                  ))) AS avg_time_sec,
       Count(DISTINCT users.UID)      number_of_user
FROM   users
       join logins
         ON user_uid = UID
       join (SELECT login,
                    Min(operation_date)
             FROM   billing.operations
             WHERE  operation_type = 'deposit'
             GROUP  BY login) op USING (login)
       join (SELECT login,
                    Min(order_close_date)
             FROM   orderstat.orders
             GROUP  BY login) ord USING (login)
WHERE  account_type = 'real'
       AND registration_date :: DATE >= current_date - 90
GROUP  BY country
ORDER  BY number_of_user DESC;  
"""

In [26]:
data_2_2 = pd.read_sql(sql_2_2, connection)
data_2_2.head()

                  country  avg_time_sec  number_of_user
0                   Italy   4316757.400               5
1                Guernsey   3830268.182               5
2                 Belgium   4114936.500               5
3  Bosnia and Herzegovina   5194963.833               4
4                   China   2313945.000               4

In [27]:
sql_3 = """ WITH all_user
     AS (SELECT country,
                Count(DISTINCT users.uid) number_of_all_user
         FROM   users
         GROUP  BY country),
     user_avg_1k
     AS (SELECT country,
                Count(DISTINCT users.uid) number_of_1k_user,
                Avg(amount)               AS avg_deposit
         FROM   users
                JOIN logins
                  ON user_uid = uid
                JOIN billing.operations using (login)
         GROUP  BY country
         HAVING Avg(amount) >= 1000)
SELECT all_user.country,
       number_of_all_user,
       number_of_1k_user
FROM   all_user
       LEFT JOIN user_avg_1k using (country);  
"""

In [28]:
data_3 = pd.read_sql(sql_3, connection)
data_3.head()

          country  number_of_all_user  number_of_1k_user
0     Afghanistan                   6                  6
1         Albania                   2                  2
2         Algeria                   3                  3
3  American Samoa                   1                  1
4         Andorra                   5                  5

In [29]:
sql_4 = """ SELECT *
FROM   (SELECT uid,
               login,
               operation_date,
               Row_number()
                 OVER (
                   partition BY uid
                   ORDER BY operation_date ASC) AS seq_number
        FROM   users
               JOIN logins
                 ON user_uid = uid
               JOIN billing.operations using (login)) data
WHERE  data.seq_number <= 3;
"""

In [30]:
data_4 = pd.read_sql(sql_4, connection)
data_4.head()

,uid,login,operation_date,seq_number
0,daf7414e-f9b7-11ea-a598-8c8590230075,9ac240ee-3a87-4aed-8241-5b01768ba65e,2020-09-02 07:11:33,1
1,daf7414e-f9b7-11ea-a598-8c8590230075,068fbf36-3109-44cf-897e-87cc4db73f2f,2020-09-05 02:27:31,2
2,daf7414e-f9b7-11ea-a598-8c8590230075,b029d31c-45fe-40d8-98dd-c9c5c330da9d,2020-09-05 15:43:42,3
3,daf74324-f9b7-11ea-a598-8c8590230075,cc3b7bf3-77d9-4bc5-b79b-e9f6d0bfa861,2020-05-27 01:56:36,1
4,daf74324-f9b7-11ea-a598-8c8590230075,7da54a62-af96-4f34-b2d8-106a94796858,2020-06-04 12:37:19,2